#!/bin/bash

clear

grep -rnp --color="auto" \
    -e "林陳海" \
    -e "寶佳資產" -e "嘉源投資" \
    -e "合陽管理" -e "合佳投資" \
    -e "曾淑瓊"   -e "合毅國際投資" \
    -e "緣璞建設" -e "澄緣投資" \
    -e "林家宏" \
    -e "和築"     -e "佳峻投資"     -e "和發國際投資" \
    -e "寶福能源" \
    -e "鄭斯聰" \
    -e "大捷投資" -e "源通投資" \
    -e "白淑貞"   -e "寶壽能源"     -e "合欣投資股份有限公司" \
    -e "寶順能源" -e "合遠國際投資" -e "寶佳建築經理" \
    -e "陳秀靖" \
    -e "吳素秋"   -e "嘉源投資" \
    -e "吳佩娟" \
    ./datafiles/taiex/majority/*.txt \
    | tee /dev/tty | wc -l

exit 0
